In [2]:
import numpy as np
import tkinter
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
matplotlib.use('Qt5Agg')
from pandas_profiling import ProfileReport

In [3]:
nf = pd.read_csv('netflixdatanew.csv')

In [4]:
nf.head()

,Country_code,Country,Total Library Size,No. of TV Shows,No. of Movies,Cost Per Month - Basic ($),Cost Per Month - Standard ($),Cost Per Month - Premium ($)
0,ar,Argentina,4760,3154,1606,3.74,6.30,9.26
1,au,Australia,6114,4050,2064,7.84,12.12,16.39
2,at,Austria,5640,3779,1861,9.03,14.67,20.32
3,be,Belgium,4990,3374,1616,10.16,15.24,20.32
4,bo,Bolivia,4991,3155,1836,7.99,10.99,13.99

In [5]:
nf.shape

(65, 8)

In [6]:
nf.columns

Index(['Country_code', 'Country', 'Total Library Size', 'No. of TV Shows',
       'No. of Movies', 'Cost Per Month - Basic ($)',
       'Cost Per Month - Standard ($)', 'Cost Per Month - Premium ($)'],
      dtype='object')

In [7]:
nf = nf.rename(columns = {'Country_code' : 'Country_Code', 'Total Library Size' : 'Library_Size', 
                         'No. of TV Shows' : 'No_TV_Shows', 'No. of Movies' : 'No_Movies', 
                         'Cost Per Month - Basic ($)' : 'Basic_Cost_Per_Month', 
                         'Cost Per Month - Standard ($)' : 'Standard_Cost_Per_Month', 
                         'Cost Per Month - Premium ($)' : 'Premium_Cost_Per_Month'})

In [8]:
nf.head()

,Country_Code,Country,Library_Size,No_TV_Shows,No_Movies,Basic_Cost_Per_Month,Standard_Cost_Per_Month,Premium_Cost_Per_Month
0,ar,Argentina,4760,3154,1606,3.74,6.30,9.26
1,au,Australia,6114,4050,2064,7.84,12.12,16.39
2,at,Austria,5640,3779,1861,9.03,14.67,20.32
3,be,Belgium,4990,3374,1616,10.16,15.24,20.32
4,bo,Bolivia,4991,3155,1836,7.99,10.99,13.99

In [9]:
nf.dtypes

Country_Code                object
Country                     object
Library_Size                 int64
No_TV_Shows                  int64
No_Movies                    int64
Basic_Cost_Per_Month       float64
Standard_Cost_Per_Month    float64
Premium_Cost_Per_Month     float64
dtype: object

In [10]:
nf.isnull().sum()

Country_Code               0
Country                    0
Library_Size               0
No_TV_Shows                0
No_Movies                  0
Basic_Cost_Per_Month       0
Standard_Cost_Per_Month    0
Premium_Cost_Per_Month     0
dtype: int64

In [11]:
nf.describe(include = 'object')

       Country_Code    Country
count            65         65
unique           65         65
top              ar  Argentina
freq              1          1

In [12]:
nf['Country_Code'].unique()

array(['ar', 'au', 'at', 'be', 'bo', 'br', 'bg', 'ca', 'cl', 'co', 'cr',
       'hr', 'cz', 'dk', 'ec', 'ee', 'fi', 'fr', 'de', 'gi', 'gr', 'gt',
       'hn', 'hk', 'hu', 'is', 'in', 'id', 'ie', 'il', 'it', 'jp', 'lv',
       'li', 'lt', 'my', 'mx', 'md', 'mc', 'nl', 'nz', 'no', 'py', 'pe',
       'ph', 'pl', 'pt', 'ro', 'ru', 'sm', 'sg', 'sk', 'za', 'kr', 'es',
       'se', 'ch', 'tw', 'th', 'tr', 'ua', 'gb', 'us', 'uy', 've'],
      dtype=object)

In [13]:
nf['Country_Code'].value_counts()

ar    1
li    1
my    1
mx    1
md    1
     ..
id    1
ie    1
il    1
it    1
ve    1
Name: Country_Code, Length: 65, dtype: int64

In [14]:
nf['Country'].unique()

array(['Argentina', 'Australia', 'Austria', 'Belgium', 'Bolivia',
       'Brazil', 'Bulgaria', 'Canada', 'Chile', 'Colombia', 'Costa Rica',
       'Croatia', 'Czechia', 'Denmark', 'Ecuador', 'Estonia', 'Finland',
       'France', 'Germany', 'Gibraltar', 'Greece', 'Guatemala',
       'Honduras', 'Hong Kong', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Ireland', 'Israel', 'Italy', 'Japan', 'Latvia',
       'Liechtenstein', 'Lithuania', 'Malaysia', 'Mexico', 'Moldova',
       'Monaco', 'Netherlands', 'New Zealand', 'Norway', 'Paraguay',
       'Peru', 'Philippines', 'Poland', 'Portugal', 'Romania', 'Russia',
       'San Marino', 'Singapore', 'Slovakia', 'South Africa',
       'South Korea', 'Spain', 'Sweden', 'Switzerland', 'Taiwan',
       'Thailand', 'Turkey', 'Ukraine', 'United Kingdom', 'United States',
       'Uruguay', 'Venezuela'], dtype=object)

In [17]:
plt.figure(figsize = (12,6))
top_15_country = nf['Country'][:15]
chart = nf.groupby(top_15_country)['Basic_Cost_Per_Month'].sum().sort_values(ascending = False).plot(kind = 'bar', color = 'seagreen')
chart.set_xticklabels(chart.get_xticklabels(), rotation = 45)
plt.title('Top 15 countries based on Total Basic Cost Per Month', fontsize = 16, pad = 14)
plt.xlabel('Country', fontsize = 14)
plt.ylabel('Total Basic Cost Per Month ($)', fontsize = 14)
plt.savefig("basic_cost", facecolor='w', bbox_inches="tight", pad_inches=0.3, transparent=True)

In [18]:
plt.figure(figsize = (12,6))
chart = nf.groupby(top_15_country)['Premium_Cost_Per_Month'].sum().sort_values(ascending = False).plot(kind = 'bar', color = 'peru')
chart.set_xticklabels(chart.get_xticklabels(), rotation = 45)
plt.title('Top 15 of Country based on Total Premium Cost Per Month', fontsize = 16, pad = 14)
plt.xlabel('Country', fontsize = 14)
plt.ylabel('Total Premium Cost Per Month ($)', fontsize = 14)
plt.savefig("premium_cost", facecolor='w', bbox_inches="tight", pad_inches=0.3, transparent=True)